/*
#include<bits/stdc++.h>

using namespace std;

int main()

{

 // string s="hello world"; // আমরা নরমালি এভাবে এসাইন করি স্ট্রিং। 

 string s("hello world"); // স্ট্রিং ক্লাসকে কল করে কন্সট্রাক্টরকে একটি স্ট্রিং দিয়ে দিচ্ছি। কন্সট্রাক্টর সেটি স্ট্রিং s এর মধ্যে এসাইন করে দিচ্ছে। 

 cout<<s<<endl;

 return 0;

}
*/

/*
#include<bits/stdc++.h>

using namespace std;

int main()

{

 string s("hello world",7); // স্ট্রিং ক্লাসকে কল করে কন্সট্রাক্টরকে একটি স্ট্রিং এবং একটি নাম্বার 7 দিয়ে দিচ্ছি। কন্সট্রাক্টর সেই স্ট্রিং এর প্রথম 7টি ক্যারেক্টার স্ট্রিং s মধ্যে এসাইন করে দিচ্ছে। 

 cout<<s<<endl; // প্রিন্ট করলে দেখতে পাব প্রথম 7টি ক্যারেক্টার স্ট্রিং এর মধ্যে আছে।

 return 0;

}
*/

/*
#include<bits/stdc++.h>

using namespace std;

int main()

{

 string a="hello world"; // একটি স্ট্রিং ভেরিয়েবল নেওয়া হয়েছে। 

 string s(a,4); // স্ট্রিং ক্লাসকে কল করে কন্সট্রাক্টরকে একটি স্ট্রিং ভেরিয়েবল a এবং একটি নাম্বার 4 দিয়ে দিচ্ছি। কন্সট্রাক্টর সেই স্ট্রিং a এর প্রথম 4টি ক্যারেক্টার বাদ দিয়ে বাকি অংশটুকু স্ট্রিং s মধ্যে এসাইন করে দিচ্ছে। 

 cout<<s<<endl; // প্রিন্ট করলে দেখতে পাব প্রথম 4টি ক্যারেক্টার বাদে বাকি অংশটুকু স্ট্রিং এর মধ্যে আছে।

 return 0;

}
*/

#include<bits/stdc++.h>

using namespace std;

int main()

{

 string s(26,'A'); // স্ট্রিং ক্লাসকে কল করে কন্সট্রাক্টরকে একটি নাম্বার 26 এবং একটি ক্যারেক্টার A দিয়ে দিচ্ছি। কন্সট্রাক্টর সেই স্ট্রিং s এর মধ্যে 26টি A এসাইন করে দিচ্ছে। 

 cout<<s<<endl; // প্রিন্ট করলে দেখতে পাব 26টি A স্ট্রিং এর মধ্যে আছে।

 return 0;

}