/*
#include <bits/stdc++.h>

using namespace std;

int main()

{

 int n; 

 cin >> n; // এরে সাইজ ইনপুট নিচ্ছি। 

 int *a = new int[n]; // সেই সাইজের ডায়নামিক এরে ডিক্লেয়ার করছি যা হিপ মেমরিতে স্টোর থাকবে।

 for (int i = 0; i < n; i++)

 {

 cin >> a[i]; // নরমাল পদ্ধতিতে এরে ইনপুট নিচ্ছি। 

 }

 for (int i = 0; i < n; i++)

 {

 cout << a[i] << endl; // নরমাল পদ্ধতিতে আউটপুট দেখাচ্ছি।

 }

 return 0;

}
*/


/*
#include<bits/stdc++.h>

using namespace std;

int* fun()

{

 int a[5]; // ৫ সাইজের স্ট্যাটিক এরে ডিক্লেয়ার করা হয়েছে। 

 for(int i=0;i<5;i++)

 {

 cin >> a[i]; // ইউজার থেকে এরে এলিমেন্ট ইনপুট নেওয়া হচ্ছে। 

 } 

 return a; // স্ট্যাটিক এরে রিটার্ন করে দেওয়া হচ্ছে। 

}

int main()

{

 int *p = fun(); // স্ট্যাটিক এরে রিসিভ করা হচ্ছে পয়েন্টার দিয়ে। 

 for(int i=0;i<5;i++)

 {

 cout << p[i] << " "; // সেই পয়েন্টার দিয়ে এরে এলিমেন্ট প্রিন্ট করার চেষ্টা করা হচ্ছে।

 }

}
*/


/*
#include<bits/stdc++.h>

using namespace std;

int* fun()

{

 int* a = new int [5]; // ৫ সাইজের ডায়নামিক এরে ডিক্লেয়ার করা হয়েছে। 

 for(int i=0;i<5;i++) 

 {

 cin >> a[i]; // ইউজার থেকে এরে এলিমেন্ট ইনপুট নেওয়া হচ্ছে। 

 }

 return a; // ডায়নামিক এরে রিটার্ন করে দেওয়া হচ্ছে। 

}

int main()

{

 int *p = fun(); // ডায়নামিক এরে রিসিভ করা হচ্ছে পয়েন্টার দিয়ে। 

 for(int i=0;i<5;i++)

 {

 cout << p[i] << " "; // সেই পয়েন্টার দিয়ে এরে এলিমেন্ট প্রিন্ট করা হচ্ছে।

 }

}
*/