/*
class class_name [ নরমালি ক্যাপিটাল লেটারে লিখা হয়। না লিখলেও কাজ করবে ] 
{
public:    [ access_modifier টোটাল ৩ ধরনের হয়ঃ Public, Private, Protected ]
    data_type variable_name;
    data_type variable_name;
    ...........
};
*/


/*
class_name object_name;
object_name.class_variable   [ অবজেক্ট এর ক্লাস ভেরিয়েবলগুলো এক্সেস করতে হলে . (ডট) ব্যাবহার করতে হয় ]
*/


/*
#include <bits/stdc++.h>

using namespace std;

class Student // ক্লাস ক্রিয়েট করা হয়েছে। 

{

public: // এক্সেস মডিফায়ার হিসেবে পাবলিক দেওয়া হয়েছে। 

 char name[100]; // ক্লাস ভেরিয়েবল ডিক্লেয়ার করা হয়েছে। 

 int roll;

 double cgpa;

};

int main()

{

 Student a, b; // Student ক্লাসের অবজেক্ট ক্রিয়েট করা হচ্ছে ২টি। 

 cin.getline(a.name, 100); // শুরুতে প্রথম অবজেক্টের নাম ইনপুট নেয়া হচ্ছে। নামের মধ্যে স্পেস থাকতে পারে তাই গেটলাইন দিয়ে ইনপুট নেওয়া হয়েছে। 

 cin >> a.roll >> a.cgpa; // তারপর প্রথম অবজেক্টের রোল এবং সিজিপিএ ইনপুট নেওয়া হচ্ছে।

 getchar(); // প্রথম অবজেক্টের রোল এবং সিজিপিএ ইনপুট দেওয়ার পর একটি এন্টার দেওয়া হবে তারপর দ্বিতীয় অবজেক্টের নাম ইনপুট দেওয়া হবে। সেই এন্টারটি ইগনোর করার জন্য getchar() ইউজ করা হয়েছে। 

 cin.getline(b.name, 100); // দ্বিতীয় অবজেক্টের নাম ইনপুট নেয়া হচ্ছে।

 cin >> b.roll >> b.cgpa; // তারপর দ্বিতীয় অবজেক্টের রোল এবং সিজিপিএ ইনপুট নেওয়া হচ্ছে।

 

 cout << a.name << " " << a.roll << " " << a.cgpa << endl; // প্রথম অবজেক্ট এর নাম, রোল, সিজিপিএ প্রিন্ট করা হচ্ছে।

 cout << b.name << " " << b.roll << " " << b.cgpa << endl; // দ্বিতীয় অবজেক্ট এর নাম, রোল, সিজিপিএ প্রিন্ট করা হচ্ছে।

 return 0; 

}
*/