/*
sort( starting_pointer, ending_pointer); 
*/


/*
#include <bits/stdc++.h>

using namespace std;

int main()

{

 int n;

 cin >> n; // সাইজ ইনপুট নেওয়া হচ্ছে। 

 int a[n]; // সেই সাইজের এরে ডিক্লেয়ার করা হচ্ছে। 

 for (int i = 0; i < n; i++) 

 {

 cin >> a[i]; // এরে ইনপুট নেওয়া হচ্ছে। 

 }

 sort(a, a + n); // সর্ট ফাংশনের মধ্যে স্টারটিং পয়েন্টার হিসেবে এরের প্রথম ইন্ডেক্স এবং এন্ডিং পয়েন্টার হিসেবে এরের সাইজ দিয়ে দেওয়া হচ্ছে। তাহলে ০ ইনডেক্স থেকে সাইজ-১ ইন্ডেক্স পর্যন্ত সর্ট হবে অর্থাৎ সম্পূর্ণ এরেটি সর্ট হবে। আমরা যদি a+3 লিখতাম তাহলে ০ ইন্ডেক্স থেকে ২ ইনডেক্স পর্যন্ত সর্ট হতো। 

 for (int i = 0; i < n; i++)

 {

 cout << a[i] << " "; // এরে প্রিন্ট করা হচ্ছে। 

 }

 return 0;

}
*/


/*
#include <bits/stdc++.h>

using namespace std;

int main()

{

 int n;

 cin >> n; 

 int a[n];

 for (int i = 0; i < n; i++)

 {

 cin >> a[i];

 }

 sort(a, a + n, greater<int>()); // সর্ট ফাংশনের মধ্যে স্টারটিং পয়েন্টার হিসেবে এরের প্রথম ইন্ডেক্স এবং এন্ডিং পয়েন্টার হিসেবে এরের সাইজ দিয়ে দেওয়া হচ্ছে। বড় থেকে ছোট অর্ডারে সর্ট করতে চাই তাই greater ফাংশনকে কল করা হয়েছে তার মধ্যে এরের ডাটা টাইপ int দিয়ে দেওয়া হয়েছে। 

 for (int i = 0; i < n; i++)

 {

 cout << a[i] << " ";

 }

 return 0;

}
*/