#include<bits/stdc++.h>

using namespace std;

int main()

{

 string s;

 cin>>s;

 // for(int i=0;i<s.size();i++) // নরমালি আমরা এভাবে লুপ চালাতাম। এটি ইন্ডেক্স বেসড লুপ। এখানে আমরা ইন্ডেক্স এর উপর লুপ চালিয়ে তারপর সেই ইনডেক্সে থাকা ভেলু প্রিন্ট করে দেই।

 // {

 // cout<<s[i]<<endl;

 // }

 for(char c:s) // শর্টকাটে রেঞ্জ বেসড ফর লুপ চালানো হয়েছে। এই লুপ প্রতিবার স্ট্রিং s থেকে একটি করে ক্যারেক্টার c বের করে নিয়ে আসবে।

 {

 cout<<c<<endl; // তারপর সেই ক্যারেক্টার c কে প্রিন্ট করে দেওয়া হচ্ছে। 

 }

 return 0;

}