/*
#include<bits/stdc++.h>
using namespace std;
int main()
{
    int x = 10;          // একটি ইন্টিজার ভেরিয়েবল ডিক্লেয়ার করে তাতে ১০ রেখে দেওয়া হচ্ছে। 
    cout << x << endl;   // ভেরিয়েবলটি প্রিন্ট করা হচ্ছে।
}
*/

/*
data_type * pointer_name  = new data_type
*/

/*
#include<bits/stdc++.h>

using namespace std;

int main()

{

 int *x = new int; // ডায়নামিক মেমরিতে একটি ইন্টিজার ভেরিয়েবল ডিক্লেয়ার হলো এবং তার এড্রেস স্টোর করা হচ্ছে p নামক পয়েন্টারে। 

 *x = 10; // পয়েন্টারকে ডিরেফারেন্স করে ডায়নামিক মেমরিতে স্টোর থাকা ভেরিয়েবলের মধ্যে ১০ রেখে দেওয়া হচ্ছে। 

 cout << *x << endl; // পয়েন্টারকে ডিরেফারেন্স করে ভেরিয়েবলটি প্রিন্ট করা হচ্ছে।

}
*/